{"hub/After-Effects":{"title":"After Effects","links":["leon/Smooth-Credit-Scrolling-in-After-Effects","leon/Leon-wants-to-add"],"tags":["AfterEffects"],"content":"The table of contents for After Effects\n\n\nSmooth Credit Scrolling in After Effects\n\n\nLeon wants to add\n\n\n\n\n"},"hub/Cinema-4D":{"title":"Cinema 4D","links":["jan/Procedural-Vertex-Map-to-Poly-Selection-Conversion"],"tags":["Cinema4d"],"content":"\nProcedural Vertex Map to Poly Selection Conversion\n"},"hub/Houdini":{"title":"Houdini","links":["resources/Good-Houdini-Resources","leon/Turn-On-Houdini-Auto-Save-By-Default","leon/How-to-dejitter-simulated-lines-(and-draw-them-in-the-first-place)","leon/Leon-wants-to-add"],"tags":["Houdini"],"content":"The table of contents for Houdini\n\n\nGood Houdini Resources\n\n\nTurn On Houdini Auto Save By Default\n\n\nHow to dejitter simulated lines (and draw them in the first place)\n\n\nLeon wants to add\n\n\n\n\n"},"hub/Octane":{"title":"Octane","links":["misc/WIP---We-are-just-getting-started"],"tags":["Octane"],"content":"WIP - We are just getting started"},"hub/Redshift":{"title":"Redshift","links":["resources/Good-Redshift-Resources"],"tags":["Redshift"],"content":"The table of contents for Redshift\n\nGood Redshift Resources\n\n\n\n"},"hub/TouchDesigner":{"title":"TouchDesigner","links":[],"tags":[],"content":""},"hub/Unreal-Engine":{"title":"Unreal Engine","links":["pascal/Creating-and-adding-a-widget-to-the-viewport","pascal/Practically-using-fInterp-and-vInterp-to-make-a-widget-follow-our-mouse-(with-smooth-interpolation)","pascal/Pascal-wants-to-add"],"tags":["UnrealEngine5"],"content":"The table of contents for Unreal Engine\n\nCreating and adding a widget to the viewport\nPractically using fInterp and vInterp to make a widget follow our mouse (with smooth interpolation)\nPascal wants to add\n\n\n\n"},"index":{"title":"Hello World.","links":["hub/Houdini","hub/Cinema-4D","hub/Unreal-Engine","hub/TouchDesigner","hub/Redshift","hub/Octane","misc/Goals-for-the-oddlyspecific-knowledge-base"],"tags":["onboarding"],"content":"This is a knowledge base by Pasi, Jan &amp; Leon. We document our digital findings and learnings. Maybe it’s useful for you!\nBasically it’s a blog about things that are oddlyspecific.\nContent\nCurrently we are documenting our work separately. We are mainly working  with Houdini, Cinema 4D, Unreal Engine TouchDesigner &amp; render with Redshift or Octane. You can find our separated notes in the respective folders on the left, the hub pages will help you as an index and starting point.\nIf you have any questions, feel free to paste them below!\nGoals for the oddlyspecific knowledge base are focused around collecting solutions that are sometimes non trivial &amp; quite niche, as we’ve all had that feeling of being the only person in the world with that specific problem.\n\n\n"},"jan/Procedural-Vertex-Map-to-Poly-Selection-Conversion":{"title":"Procedural Vertex Map to Poly Selection Conversion","links":[],"tags":["Cinema4d"],"content":"In some edge cases you need a poly selection instead of a vertex map, but the vertex map is all you got. Maybe you need it because Octane runs more stable with poly selections or maybe some good old fashioned Cinema 4D tools don’t accept vertex maps. Looking at you PMatterWaves!\nIt often came handy to me that there is an easy and even procedural way:\nMake a nice and fancy vertex map.\n\nGo to Select and make a poly selection. It doesn’t matter what’s in it.\n\nIn the selection tag attributes enable Use Fields\n\nDrag the vertex map tag in the new fields panel of the poly selection tag.\n\nNow the conversion is finished.\n\nIf you have an animated vertex map and need to convert this frame perfectly to a poly selection just do the steps above. Now you have an animated poly selection. Nice.\n"},"leon/How-to-dejitter-simulated-lines-(and-draw-them-in-the-first-place)":{"title":"How to dejitter simulated lines (and draw them in the first place)","links":["misc/WIP---We-are-just-getting-started"],"tags":["Houdini"],"content":"This is WIP. I will add images, videos and project files later, as I’m currently writing this.\n\nThis note is a rather funny one as the problem started nondescript:\nProlog\nI was working on a project where the art director requested a drawn line, that is able to grow and dance on the floor. Sure thing, I’ll just start with the Point Relax Tutorial by Entagma and see where it takes me.\n\n„Before I came here, I was confused about this subject. Having listened to your lecture, I am still confused — but on a higher level.“\n– Enrico Fermi\n\nLine of sight\nIt kinda did what I wanted it to do. The first addition was the ability to spawn/draw a line and then make it evolve over time.\nThe use of an input animation, which I then sampled each frame to generate a line was really straight forward but efficient.\nI then tweaked the hell out of the resample resolution, the point relax amount and iterations.\nYoung naive thoughts\nThe result was very satisfying and feedback was „looks great - now we just need to remove the jittering“.\nJust some smoothing &amp; blurring and we’re done, I thought with my naive youthful brain. I didn’t know I was heading straight into a problem that’s currently not optimally solveable for computers (if you know an easy way to solve my problem, please tell me. I talked to a few Houdini artists but no one had a simpler solution).\nRealizing the magnitude of the problem\nNeither smoothing or blurring, not to mention filtering in chops, did the trick. I realized that the problem was time dependent and due to the changing point count and line proportions, all the information attainable was all over the place. You can’t easily create a relation between the points because everything is changing all the time everywhere.\nBefore you ask - yes everything was a little smoother but the jittering (as shown in the image added later) happened on a very intricate small scale over time, it’s not really something that disappears if you smooth the line at a single frame in time.\nVisualizing the problem\nFirst I needed to understand what jittering is in the first place. Therefore I added some indicators to my points, showing their velocity.\nTo get the velocity I calculated the movement depending on the nearest point of the last frame (trail SOP won’t work because of a changing point count).\n(VEX snippet and screenshot)\nAfter calculation I transferred the velocity (based on the nearest point) of the previous frame to my current line, to get a direkt comparison. It’s kind of mesmerizing how you can see where chaos emerges and how a uniform direction keeps the line clear and nice.\nGIF/Video of jittering lines\nAfter setting up indicators, I was ready to solve to problem.\n1. Attempt\nMy first idea was to find the line parts that are jittering by checking their velocity over time. I already built the visualiser, now I just need to modify it. To get the desired result, I multiplied the two visualiser vectors with eachother. The result would give a third vector which either appears rather small or rather large. I then defined a threshold under which the points would be classified as “jittering”. The Generated group is then smoothed in the hope to cancel out the local jitter.\n1. Result\nSadly that didn’t really do the trick, as the jittering was still present. The point count changed to much over time, therefore the line was drifting all over the place. The isolated smoothing reduced to irregularities on a still frame, but in motion it still appeared hectic.\n2. Attempt\nMy second idea was to calculate the angle in which the points are related to eachother on the line. The goal was to dampen that angle if it exceeds a certain threshold. In hindsight, it’s not really more than a different angle on the 1. Attempt, but it felt like good idea in that moment.\nI think I’ve found about 5-6 variations to acquire the same group of points, maybe there will be use cases where only one of them does the trick. Other than that I’m just telling myself all this time is not totally wasted.\n2. Result\nSee 1. Result but in visually slightly different.\n3. Attempt\nNow I was somewhere between desperate and cheeky, as my idea was to just force a constant point count. Easily done by resampling the line with a fixed segment count. I looked at the last frame and upped the number until it compared to the actual simulation quality wise.\nOnly now I actually understood what is going on with the line. Reading all of this some of you might maybe go like “duh obvious you are doing x and that results in y”, but if you are so far off the deep and like I was, sometimes you struggle to see the obvious.\nThe line was expanding all over the place. Imagine blowing up a balloon with even smaller balloons scattered on it’s surface. Due to the randomness of line growth you can’t really fixate a certain point on the line, as it’s relations and partitions change without logic or causality. In simple words: Stuff is all over the place.\n3. Result\nNo improvement here - I just realized (maybe not so) obvious things.\n3.1 Attempt\nNow it’s getting overcomplicated…\nEpilog\nWho would have thought a simple jittering line can occupy my mind for almost 2 weeks. I think this is a classic Houdini project in how it spirals out of control with ease. It’s reassuring that I got it working at last, but it’s still kind of janky. A very interesting problem and I’m pretty sure one can make an even longer post/paper out of it, if one starts searching for use cases and practical applications.\nProject files if you want to take a stab at the line and dejitter it yourself at home. "},"leon/Leon-wants-to-add":{"title":"Leon wants to add","links":["leon/How-to-dejitter-simulated-lines-(and-draw-them-in-the-first-place)"],"tags":[],"content":"\n VEX Library\n\n Babel note\n\n\n HDA Library\n\n Proxy Maker\n Better filecache\n Redshift target light\n Fast ROP &amp; MAT setup\n Bake camera for export\n ”OUT_” Null\n rs Material Setups\n Stamp textures (intertwined with tutorial setup)\n\n\n More resources\n\n YouTube\n Vimeo\n Websites\n\n\n My preferred UI Setup\n Note describing how this Page is setup and how the customizations came about\n\n Motivation\n Team\n Hurdles (finding the right approach, .css, Auto Deploy, Comments)\n Benefits (collab, scalability, custom shit)\n\n\n\n\nIf I start with tutorials, this is what you might need to expect\n\n Setups\n\n How to dejitter simulated lines (and draw them in the first place)\n Map pull apart (Convert image to spline)\n Self balancing machine\n Import .csv in a useful way\n Binary converter\n Strom Stuff (Landscape, Ionen etc.)\n Quick playing cards\n Photoscan pipeline workflows\n Coin flip\n Lego Ocean\n Germany RKI Corona viz\n Build struts for 3d printing (distance fixer and recursive solving HDA)\n Chladnic shapes\n Rain trailing (the shitty version)\n Handwritten fonts\n Selfmade Guided Growth Solver #61 (Check if Entagma did that already lol)\n Selfmade Tiltbrush in VR and everything that comes with it → YouTube Series and Sidequest Goal?\n Getting started with osm data when you have no idea what you are doing\n\n OSM Data and landscape automation\n Mapbox\n Toner\n Houdini Workflow\n\n\n\n\n Tutorials note in babel\n"},"leon/Smooth-Credit-Scrolling-in-After-Effects":{"title":"Smooth Credit Scrolling in After Effects","links":[],"tags":["AfterEffects"],"content":"Just the snippet if you want to have smooth credits scrolling at an even rate.\nYou can change the rate to change the pixel advancement.\nrate = 2; //value in px/sec.\nif (marker.numKeys &gt; 0){\nif (time &gt; marker.key(1).time){\nvalue - [0,rate*timeToFrames(time-marker.key(1).time)];\n}else{\nvalue;\n}\n}else{\nvalue - [0,rate*timeToFrames(time-inPoint)];\n}\n\nI got this from: pastebin.com/vhmnusgV\nYouTube Tutorial: www.youtube.com/watch"},"leon/Turn-On-Houdini-Auto-Save-By-Default":{"title":"Turn On Houdini Auto Save By Default","links":[],"tags":["Houdini"],"content":"You probably know why you are here…\nCreate a text file, name it 123.py and paste\nimport hou \nhou.appendSessionModuleSource(&#039;&#039;&#039;hou.hscript(&quot;autosave on&quot;)&#039;&#039;&#039;)` \n\nin the file.\nPut it in your Documents&gt;houdini18.x&gt;scripts folder (create one if it doesn’t exist) and there you go. I’ve never lost more than 2 minutes of work.\nFor the lazy: Download my “123.py” (yes it rhymes on purpose).\n\n\n"},"leon/outdated---How-to-overcomplicate-a-website-or-how-I-set-this-blog-up":{"title":"outdated - How to overcomplicate a website or how I set this blog up","links":[],"tags":["Webdev"],"content":"I started using Obsidian a few years ago for note taking. As I wanted to sync with my phone and computer and couldn’t spend the money, I set up a repo in GitHub and used that for the time being.\nNow the idea came up to create a 3D blog and I ideally wanted it based out of my notes app. Ideally ideally I’d write my notes and somewhere on the internet a website showcases them. Ideally ideally Ideally I’d like that without paying money.\nFear not - all of this is possible with 2-6 days of research and a high tolerance for patience.\nDisclaimer: this solution is based on my preferences and workflow. It may not fit for you and there a tons of good alternatives, I don’t want to say this is the way you have to do it - but you can.\nThis write up is heavily based on obsidian-zola (I basically modified some stuff to my liking but forked it as a starting point).\n1. Setting up Obsidian with a GitHub repository\nYou need a GitHub account. Download Obsidian And GitHub Desktop to set up your first repo. Point Obsidian to your cloned repository folder on your computer (it can be empty). Obsidian will now create some mandatory files to style and interpret your notes.\nAs a side note: Obsidian uses markdown language and the Obsidian app works as an interpreter. If you deinstall Obsidian all your notes will still be open and human readable. Some features like note linking and graph view won’t be possible anymore. But that’s to be expected.\n2. Adding your first notes and content\nOnce the general setup is down you can continue with the fun stuff. Add my .gitignore to your repo to ignore some files, that are not needed or are different between different machines.\nCreate a note and start writing. Maybe even connect a few notes and link them. Afterwards just commit and push your content to the repository and all your stuff is saved.\n3. Setting up the website\nTo setup the website I used Netlifly. Connect your GitHub and authorise Netlifly to use your repositoies.\nNow you need a configuration file that will be used as a pointer to build your website. I linked my customised one, if you want to start clean (I’d recommend) you should use this starting point. It’s from the obsidian-zola repo that makes all of this possible. Tweak the setting you are allowed to change but keep in mind  that SITE_URL, REPO_URL and LANDING_PAGE cannot be left empty. Be aware that LANDING-PAGE is slugified and expects ”-” instead of ” “.\nOnce everything is added to the repo folder you can push it to GitHub. If everything works finde you should see your site building and check the URL if everything shows up."},"misc/Goals-for-the-oddlyspecific-knowledge-base":{"title":"Goals for the oddlyspecific knowledge base","links":[],"tags":["Webdev"],"content":"Wait that worked last time I tried it!\nThis website aims to work comparable to the process of journaling, with the main difference of focusing on tech &amp; art problems.\nIdeally this website helps people who encounter the same hurdles to achieve their goals faster &amp; learn from our process &amp; mistakes. Sometimes being a (digital) artist requires banging your head against the wall over and over, so be ready for some deep dives!"},"misc/WIP---We-are-just-getting-started":{"title":"WIP - We are just getting started","links":["misc/Goals-for-the-oddlyspecific-knowledge-base"],"tags":["onboarding"],"content":"If you are reading this you’ve arrived before the knowledge. Maybe come back later and see, if we’ve added some content.\nLearn more about our goals for the oddlyspecific knowledge base!\n\n\n"},"pascal/Creating-and-adding-a-widget-to-the-viewport":{"title":"Creating and adding a widget to the viewport","links":[],"tags":["UnrealEngine5"],"content":"This may be basic but you may tend to forget to do this, so I’ll link this everywhere wehave to do it - sorry!\nCreating a Widget\n\nTo start, let’s just create a Widget Blueprint via right-clicking in the editor.\nAdding it to our Viewport\nTo add a Widget to the Viewport, we have to tell it to do so in some Active Object in our Scene. Most of the time it will be the Level Blueprint, a Player Controller, an Actor or the infamous HUD class.\nWe’ll do it in the Level Blueprint - but in some oddlyspecific case we’ll do it somewhere else, so watch out!\n\nWe are going to need a “Create Widget” Node - which will just appear as “Construct None”, but that’s alright. You’ll find it by right-clicking into the void and typing Create Widget. And then, we also need an “Add to Viewport”-Node, which should be super easy t find.\nthen, well just plug all that into the “Begin Play” - and specify our Widget of choice - and it will be there when we start our level the next time.\n"},"pascal/Pascal-wants-to-add":{"title":"Pascal wants to add","links":[],"tags":[],"content":"What I need to tell you\n\n Interpolation notes in Unreal (fInterp Playground)\n Fixing the Unreal Engine VR Template\n Editor Utility Widgets for Batch Renaming and other File Stuff\n Building Proper UIs (Create Buttons with advanced Hover Animations and reuse them — tedious stuff but can be great)\n Some fast Blender Stuff\n Quick Tips\n\n Batch Editing Stuff with the Attribute Spread Sheet\n Lock Camera Movement\n Get your Polycount down fast (and dirty - but come on, there are deadlines)\n\n\n\nWhat I have to figure out myself first\n\n Fixing weird Foliage flickering in UE 5\n Proper Pipeline for Exporting UE Sequencer Animations to a DCC - if you ever have the pleasure to have to do it, too -.-\n MIDI Controller Presets so you don’t have to configure the whole MIDI Controller Mapping yourself\n[ ]\n"},"pascal/Practically-using-fInterp-and-vInterp-to-make-a-widget-follow-our-mouse-(with-smooth-interpolation)":{"title":"Practically using fInterp and vInterp to make a widget follow our mouse (with smooth interpolation)","links":["pascal/Creating-and-adding-a-widget-to-the-viewport"],"tags":["UnrealEngine5"],"content":"Would be great if you could just tell a Widget to go where you want it to go - and it would just work?\nWell, we’ll do exactly that.\nInterp your way to the top\nLets start simple by  Creating and adding a widget to the viewport\nThen, we’ll drag and drop an Image Widget into our Canvas Panel.\nIn the Details Panel, make sure the Anchors of the Image are set to the top left corner option.\n\nBackground: fInterp To\nLet’s create one of the Stars of the day - the “fInterp To”-Node\n\nWhat it is capabe of is interpolating a Current Value Towards a Target Value, using the distance between the Positions as a kind of a multiplier for the speed, hence creating a kind of an easing effect for our movement. Everytime we call the node, it interpolates one Step further towards our desired Value, and Returns the New Value.\nSetting it up\nFor the node To work in our intended way - following our mouse cursor - we need it to update continuously, as we want to be able to move our cursor frely and expect the image to follow responsively. So - we use the Event Tick. For a less Performance-heavy Version we can also use Timers: A better Event tick? . All the InterpTo Nodes work a lot smoother on Event Tick, though.\nThe Event Tick also solves one of our Inputs instantly, providing a Delta Seconds Output (though for other Cases we can always just get the world delta seconds via a built-in function)\n\nAs we want our Current Value to be fed into the Node, brought closer to the Target and then to repeat the procedure, we create a Float Variable for it and get it as well as set it after the alternation.\n\nThen what is missing is our Target, as well as our interpolation speed.\nThe Interpolation Speed.\nIt will define The Speed in which your Value will be interpolated towards your Target.\nI would recommend to treat the Interp Speed as a fantasy Value and just eyeballing and testing different values to find the fitting one for your Use-Case.\nIf your curious how the interpolation works, though, let’s have a short excursion:\nThe Delta Time multiplied by the Interp Speed is translated to a value between 0 and 1.\nThis Value is then Multiplied by the Distance of the Current Value to the Target.\nFinally the result of that is added to the Current Value specified and then Returned to us.\nWith the Delta Time not being really Constant, this is a really tough thing to calculate beforehand, hence my recommendation - but you do you. We’ll just use 3 for this Example.\nYou can also always modify this speed at runtime.\nSetting our Images Position\nBefore coming to our Target, we have to make sure our Image can be moved by our Construction. To Do that we can Drag and drop the Image from our Variables Panel into our Graph. We choose “Get”.\nIf we now try to get anything Position related, nothing useable will show up.\nThat’s because the Image in itself doesn’t have a Position - it only has one relative to it’s parent. Thats how stuff works in Unreal. It really takes a while to get behind that and will cause headaches, but eventually things tend to work out.\nAs our parent is a Canvas Panel, we can get the “Canvas Panel Slot” in which our Image sits. If we pull out a string from there, we can get the Position easily.\nNow we can just use our Returned “Current Value” and feed it into the Y-Position of our Image.\n\nThe Target\nNow the only missing piece is our Target.\nTo try if we setup everything in the right way, we can now just type a Value betwen 0 and our Viewport Y Size in Pixels as Target, and just press Play.\nThe Image should now interpolate towards our specified Pixel position.\nIf you don’t see anything, maybe put the Interp Speed down to 1 or below. Now you should be able to recognize what happens.\nCome on little Image, follow our mouse!\nNow the only thing left to do is using our Mouse Position to drive the interpolation Target.\nFortunately, there is a node for that.\nIts called “Get Mouse Position on Viewport”\n\nWe can just use the Y Position as is - and the Widget will now follow our Mouse Cursor height with that little amount of Delay that just feels good. If it doesn’t, try adjusting your Interp speed to very high and very low values and find your favourite.\nTrust me: It’s a whole lot of fun!\nBut, what if I want it to follow X, too?\nYou could always just do a second fInterp for the X-Position- BUT:\nThe really nice thing about fInterp is, that there’s also a vInterp for Vector3’s, a tInterp for whole Transforms, and a rInterp for Rotations. And they all work the Same way.\nFor our Use-Case I would recommend using vInterp while completely ignoring the Z-Value.\nWith a right click on the vector Input or Output you can just Split it and achieve our desired effect in no time. Have Fun!\n\n"},"projects/Fragments-of-a-Dream":{"title":"Fragments of a Dream","links":[],"tags":["UnrealEngine5"],"content":"\n…is a project by Leon Monschauer and Pascal Santaella reflecting the feeling with which a dream sometimes leaves us behind. Somehow lost, somehow incomplete - but stunningly beautiful.\nIt is an audioreactive piece of the fragments series, about getting in touch with these dreams, with old fragments of memories and enjoying them in their blurry nature.\n\nWith its reactiveness to Music and ever changing aesthetics, no viewing will ever be the same.\nAnd believe us, that so much fun for us, too!\n\nSo, enjoy your stay if you see it live, as much as we enjoy it ourselves!\n\nIf you are interested in the project or what we are up to, feel free to visit this website from time to time or follow us on Instagram or TikTok\n"},"resources/Good-Houdini-Resources":{"title":"Good Houdini Resources","links":["hub/Houdini"],"tags":["resources"],"content":"Here you can find some resources that helped me learn and still help me understand all of this better.\nBlog Style Content\n\nEntagma - If you want to understand understanding &amp; also a little bit of Houdini, watch everything they make\nJohn Kunz- Crazy talented guy. Great streams 5/5\nToadstorm - one of the classic people you’ll come across when learning. You’ve maybe even seen Oil And Water before you even started learning Houdini.\nMatt’s (Tokeru) CG Wiki - The one wiki besides the Houdini Doc\nHoudini Docs - I don’t wanna state the obvious, but a lot of people coming from Adobe don’t know that programs actually have good documentation. I would print this out to read it offline, but there is no Strg+F  for printed books…\n\nYouTube Content\n\nBubble Pins - Just overall good tutorials\nEntagma’s Houdini in 5 Minutes - Want to get going fast or need to freshen up? Entagma got you covered\nHoudini isn’t scary - I personally didn’t watch the tutorials as I already knew the basics on release. But I’ve heard a lot of good about them\nSimon Houdini - procedural everything. Very nice!\n\nVimeo Content\n\nNiels Prayer - very useful tutorials if you are in between beginner and intermediate\n\n\n\n"},"resources/Good-Redshift-Resources":{"title":"Good Redshift Resources","links":["hub/Redshift"],"tags":["resources"],"content":"Here you can find some resources that helped me learn and still help me understand all of this better.\nYouTube Channel Content\n\nBlueFox Creation - not only Redshift, but very good to learn some oddly specific use cases with Redshift\n\n\n\n"},"utility/Imprint":{"title":"Imprint","links":[],"tags":[],"content":"Angaben gemäß § 5 TMG\nLeon Monschauer\nNiehler Straße 86.\n56076 Köln\nVertreten durch:\nLeon Monschauer\nKontakt: \nE-Mail: hi@leonmonschauer.de\n\nThis website is powered by Obsidian and Quartz. I can highly recommend checking these tools out.\n\nHaftungsausschluss:\nHaftung für Links\nUnser Angebot enthält Links zu externen Webseiten Dritter, auf deren Inhalte wir keinen Einfluss haben. Deshalb können wir für diese fremden Inhalte auch keine Gewähr übernehmen. Für die Inhalte der verlinkten Seiten ist stets der jeweilige Anbieter oder Betreiber der Seiten verantwortlich. Die verlinkten Seiten wurden zum Zeitpunkt der Verlinkung auf mögliche Rechtsverstöße überprüft. Rechtswidrige Inhalte waren zum Zeitpunkt der Verlinkung nicht erkennbar. Eine permanente inhaltliche Kontrolle der verlinkten Seiten ist jedoch ohne konkrete Anhaltspunkte einer Rechtsverletzung nicht zumutbar. Bei Bekanntwerden von Rechtsverletzungen werden wir derartige Links umgehend entfernen.\nUrheberrecht\nDie durch die Seitenbetreiber erstellten Inhalte und Werke auf diesen Seiten unterliegen dem deutschen Urheberrecht. Die Vervielfältigung, Bearbeitung, Verbreitung und jede Art der Verwertung außerhalb der Grenzen des Urheberrechtes bedürfen der schriftlichen Zustimmung des jeweiligen Autors bzw. Erstellers. Downloads und Kopien dieser Seite sind nur für den privaten, nicht kommerziellen Gebrauch gestattet. Soweit die Inhalte auf dieser Seite nicht vom Betreiber erstellt wurden, werden die Urheberrechte Dritter beachtet. Insbesondere werden Inhalte Dritter als solche gekennzeichnet. Sollten Sie trotzdem auf eine Urheberrechtsverletzung aufmerksam werden, bitten wir um einen entsprechenden Hinweis. Bei Bekanntwerden von Rechtsverletzungen werden wir derartige Inhalte umgehend entfernen.\nDatenschutz\nDie Nutzung unserer Webseite ist in der Regel ohne Angabe personenbezogener Daten möglich. Soweit auf unseren Seiten personenbezogene Daten (beispielsweise Name, Anschrift oder eMail-Adressen) erhoben werden, erfolgt dies, soweit möglich, stets auf freiwilliger Basis. Diese Daten werden ohne Ihre ausdrückliche Zustimmung nicht an Dritte weitergegeben.\nWir weisen darauf hin, dass die Datenübertragung im Internet (z.B. bei der Kommunikation per E-Mail) Sicherheitslücken aufweisen kann. Ein lückenloser Schutz der Daten vor dem Zugriff durch Dritte ist nicht möglich.\nDer Nutzung von im Rahmen der Impressumspflicht veröffentlichten Kontaktdaten durch Dritte zur Übersendung von nicht ausdrücklich angeforderter Werbung und Informationsmaterialien wird hiermit ausdrücklich widersprochen. Die Betreiber der Seiten behalten sich ausdrücklich rechtliche Schritte im Falle der unverlangten Zusendung von Werbeinformationen, etwa durch Spam-Mails, vor.\nDatenschutzerklärung\nVerantwortlicher im Sinne der Datenschutzgesetze, insbesondere der EU-Datenschutzgrundverordnung (DSGVO), ist:\nLeon Monschauer\nIhre Betroffenenrechte\nUnter den angegebenen Kontaktdaten unseres Datenschutzbeauftragten können Sie jederzeit folgende Rechte ausüben:\nAuskunft über Ihre bei uns gespeicherten Daten und deren Verarbeitung (Art. 15 DSGVO),\nBerichtigung unrichtiger personenbezogener Daten (Art. 16 DSGVO),\nLöschung Ihrer bei uns gespeicherten Daten (Art. 17 DSGVO),\nEinschränkung der Datenverarbeitung, sofern wir Ihre Daten aufgrund gesetzlicher Pflichten noch nicht löschen dürfen (Art. 18 DSGVO),\nWiderspruch gegen die Verarbeitung Ihrer Daten bei uns (Art. 21 DSGVO) und\nDatenübertragbarkeit, sofern Sie in die Datenverarbeitung eingewilligt haben oder einen Vertrag mit uns abgeschlossen haben (Art. 20 DSGVO).\nSofern Sie uns eine Einwilligung erteilt haben, können Sie diese jederzeit mit Wirkung für die Zukunft widerrufen.\nSie können sich jederzeit mit einer Beschwerde an eine Aufsichtsbehörde wenden, z. B. an die zuständige Aufsichtsbehörde des Bundeslands Ihres Wohnsitzes oder an die für uns als verantwortliche Stelle zuständige Behörde.\nEine Liste der Aufsichtsbehörden (für den nichtöffentlichen Bereich) mit Anschrift finden Sie unter: www.bfdi.bund.de/DE/Infothek/Anschriften_Links/anschriften_links-node.html.\nKommentarfunktion\nArt und Zweck der Verarbeitung:\nWenn Nutzer Kommentare auf unserer Website hinterlassen, werden neben diesen Angaben auch der Zeitpunkt ihrer Erstellung und der zuvor durch den Websitebesucher gewählte Nutzername gespeichert. Dies dient unserer Sicherheit, da wir für widerrechtliche Inhalte auf unserer Webseite belangt werden können, auch wenn diese durch Benutzer erstellt wurden.\nRechtsgrundlage:\nDie Verarbeitung der als Kommentar eingegebenen Daten erfolgt auf der Grundlage eines berechtigten Interesses (Art. 6 Abs. 1 lit. f DSGVO).\nDurch Bereitstellung der Kommentarfunktion möchten wir Ihnen eine unkomplizierte Interaktion ermöglichen. Ihre gemachten Angaben werden zum Zwecke der Bearbeitung der Anfrage sowie für mögliche Anschlussfragen gespeichert.\nEmpfänger:\nEmpfänger der Daten sind ggf. Auftragsverarbeiter.\nSpeicherdauer:\nDie Daten werden gelöscht, sobald diese für den Zweck der Erhebung nicht mehr erforderlich sind. Dies ist grundsätzlich der Fall, wenn die Kommunikation mit dem Nutzer abgeschlossen ist und das Unternehmen den Umständen entnehmen kann, dass der betroffene Sachverhalt abschließend geklärt ist.\nBereitstellung vorgeschrieben oder erforderlich:\nDie Bereitstellung Ihrer personenbezogenen Daten erfolgt freiwillig. Ohne die Bereitstellung Ihrer personenbezogenen Daten können wir Ihnen keinen Zugang zu unserer Kommentarfunktion gewähren.\nKontaktformular\nArt und Zweck der Verarbeitung:\nDie von Ihnen eingegebenen Daten werden zum Zweck der individuellen Kommunikation mit Ihnen gespeichert. Hierfür ist die Angabe einer validen E-Mail-Adresse sowie Ihres Namens erforderlich. Diese dient der Zuordnung der Anfrage und der anschließenden Beantwortung derselben. Die Angabe weiterer Daten ist optional.\nRechtsgrundlage:\nDie Verarbeitung der in das Kontaktformular eingegebenen Daten erfolgt auf der Grundlage eines berechtigten Interesses (Art. 6 Abs. 1 lit. f DSGVO).\nDurch Bereitstellung des Kontaktformulars möchten wir Ihnen eine unkomplizierte Kontaktaufnahme ermöglichen. Ihre gemachten Angaben werden zum Zwecke der Bearbeitung der Anfrage sowie für mögliche Anschlussfragen gespeichert.\nSofern Sie mit uns Kontakt aufnehmen, um ein Angebot zu erfragen, erfolgt die Verarbeitung der in das Kontaktformular eingegebenen Daten zur Durchführung vorvertraglicher Maßnahmen (Art. 6 Abs. 1 lit. b DSGVO).\nEmpfänger:\nEmpfänger der Daten sind ggf. Auftragsverarbeiter.\nSpeicherdauer:\nDaten werden spätestens 6 Monate nach Bearbeitung der Anfrage gelöscht.\nSofern es zu einem Vertragsverhältnis kommt, unterliegen wir den gesetzlichen Aufbewahrungsfristen nach HGB und löschen Ihre Daten nach Ablauf dieser Fristen.\nBereitstellung vorgeschrieben oder erforderlich:\nDie Bereitstellung Ihrer personenbezogenen Daten erfolgt freiwillig. Wir können Ihre Anfrage jedoch nur bearbeiten, sofern Sie uns Ihren Namen, Ihre E-Mail-Adresse und den Grund der Anfrage mitteilen.\nVerwendung von Scriptbibliotheken (Google Webfonts)\nArt und Zweck der Verarbeitung:\nUm unsere Inhalte browserübergreifend korrekt und grafisch ansprechend darzustellen, verwenden wir auf dieser Website „Google Web Fonts“ der Google LLC (1600 Amphitheatre Parkway, Mountain View, CA 94043, USA; nachfolgend „Google“) zur Darstellung von Schriften.\nDie Datenschutzrichtlinie des Bibliothekbetreibers Google finden Sie hier: www.google.com/policies/privacy/\nRechtsgrundlage:\nRechtsgrundlage für die Einbindung von Google Webfonts und dem damit verbundenen Datentransfer zu Google ist Ihre Einwilligung (Art. 6 Abs. 1 lit. a DSGVO).\nEmpfänger:\nDer Aufruf von Scriptbibliotheken oder Schriftbibliotheken löst automatisch eine Verbindung zum Betreiber der Bibliothek aus. Dabei ist es theoretisch möglich – aktuell allerdings auch unklar ob und ggf. zu welchen Zwecken – dass der Betreiber in diesem Fall Google Daten erhebt.\nSpeicherdauer:\nWir erheben keine personenbezogenen Daten, durch die Einbindung von Google Webfonts.\nWeitere Informationen zu Google Web Fonts finden Sie unter developers.google.com/fonts/faq und in der Datenschutzerklärung von Google: www.google.com/policies/privacy/.\nDrittlandtransfer:\nGoogle verarbeitet Ihre Daten in den USA und hat sich dem EU_US Privacy Shield unterworfen www.privacyshield.gov/EU-US-Framework. target=“_blank”&gt;www.privacyshield.gov/EU-US-Framework.\nBereitstellung vorgeschrieben oder erforderlich:\nDie Bereitstellung der personenbezogenen Daten ist weder gesetzlich, noch vertraglich vorgeschrieben. Allerdings kann ggfs. die korrekte Darstellung der Inhalte durch Standardschriften nicht möglich sein.\nWiderruf der Einwilligung:\nZur Darstellung der Inhalte wird regelmäßig die Programmiersprache JavaScript verwendet. Sie können der Datenverarbeitung daher widersprechen, indem Sie die Ausführung von JavaScript in Ihrem Browser deaktivieren oder einen JavaScript-Blocker installieren. Bitte beachten Sie, dass es hierdurch zu Funktionseinschränkungen auf der Website kommen kann.\nVerwendung von Adobe Typekit\nArt und Zweck der Verarbeitung:\nWir setzen Adobe Typekit zur visuellen Gestaltung unserer Website ein. Typekit ist ein Dienst der Adobe Systems Software Ireland Companies (4-6 Riverwalk, Citywest Business Campus, Dublin 24, Republic of Ireland; nachfolgend „Adobe“), der uns den Zugriff auf eine Schriftartenbibliothek gewährt. Zur Einbindung der von uns benutzten Schriftarten, muss Ihr Browser eine Verbindung zu einem Server von Adobe in den USA aufbauen und die für unsere Website benötigte Schriftart herunterladen. Adobe erhält hierdurch die Information, dass von Ihrer IP-Adresse unsere Website aufgerufen wurde. Weitere Informationen zu Adobe Typekit finden Sie in den Datenschutzhinweisen von Adobe, die Sie hier abrufen können: www.adobe.com/de/privacy/policy.html\nRechtsgrundlage:\nRechtsgrundlage für die Einbindung von Adobe Typekit und dem damit verbundenen Datentransfer zu Adobe ist Ihre Einwilligung (Art. 6 Abs. 1 lit. a DSGVO).\nEmpfänger:\nDer Aufruf von Scriptbibliotheken oder Schriftbibliotheken löst automatisch eine Verbindung zum Betreiber der Bibliothek aus. Informationen über die Nutzung Ihrer Daten durch Adobe Typekit Web Fonts Sie unter typekit.com/ und in der Datenschutzerklärung von Adobe Typekit: www.adobe.com/de/privacy/policies/typekit.html.\nSpeicherdauer:\nWir erheben keine personenbezogenen Daten durch die Einbindung von Adobe Typekit Web Fonts.\nDrittlandtransfer:\nAdobe ist unter dem Privacy-Shield-Abkommen zertifiziert und bietet hierdurch eine Garantie, das europäische Datenschutzrecht einzuhalten (www.privacyshield.gov/participant).\nBereitstellung vorgeschrieben oder erforderlich:\nDie Bereitstellung der personenbezogenen Daten ist weder gesetzlich, noch vertraglich vorgeschrieben. Allerdings kann ohne die korrekte Darstellung der Inhalte von Standardschriften nicht ermöglicht werden.\nEingebettete YouTube-Videos\nArt und Zweck der Verarbeitung:\nAuf einigen unserer Webseiten betten wir YouTube-Videos ein. Betreiber der entsprechenden Plugins ist die YouTube, LLC, 901 Cherry Ave., San Bruno, CA 94066, USA (nachfolgend „YouTube“). Wenn Sie eine Seite mit dem YouTube-Plugin besuchen, wird eine Verbindung zu Servern von YouTube hergestellt. Dabei wird YouTube mitgeteilt, welche Seiten Sie besuchen. Wenn Sie in Ihrem YouTube-Account eingeloggt sind, kann YouTube Ihr Surfverhalten Ihnen persönlich zuzuordnen. Dies verhindern Sie, indem Sie sich vorher aus Ihrem YouTube-Account ausloggen.\nWird ein YouTube-Video gestartet, setzt der Anbieter Cookies ein, die Hinweise über das Nutzerverhalten sammeln.\nWeitere Informationen zu Zweck und Umfang der Datenerhebung und ihrer Verarbeitung durch YouTube erhalten Sie in den Datenschutzerklärungen des Anbieters, Dort erhalten Sie auch weitere Informationen zu Ihren diesbezüglichen Rechten und Einstellungsmöglichkeiten zum Schutze Ihrer Privatsphäre (policies.google.com/privacy). Google verarbeitet Ihre Daten in den USA und hat sich dem EU-US Privacy Shield unterworfen www.privacyshield.gov/EU-US-Framework\nRechtsgrundlage:\nRechtsgrundlage für die Einbindung von YouTube und dem damit verbundenen Datentransfer zu Google ist Ihre Einwilligung (Art. 6 Abs. 1 lit. a DSGVO).\nEmpfänger:\nDer Aufruf von YouTube löst automatisch eine Verbindung zu Google aus.\nSpeicherdauer und Widerruf der Einwilligung:\nWer das Speichern von Cookies für das Google-Ad-Programm deaktiviert hat, wird auch beim Anschauen von YouTube-Videos mit keinen solchen Cookies rechnen müssen. YouTube legt aber auch in anderen Cookies nicht-personenbezogene Nutzungsinformationen ab. Möchten Sie dies verhindern, so müssen Sie das Speichern von Cookies im Browser blockieren.\nWeitere Informationen zum Datenschutz bei „YouTube“ finden Sie in der Datenschutzerklärung des Anbieters unter: www.google.de/intl/de/policies/privacy/\nDrittlandtransfer:\nGoogle verarbeitet Ihre Daten in den USA und hat sich dem EU_US Privacy Shield unterworfen www.privacyshield.gov/EU-US-Framework.\nBereitstellung vorgeschrieben oder erforderlich:\nDie Bereitstellung Ihrer personenbezogenen Daten erfolgt freiwillig, allein auf Basis Ihrer Einwilligung. Sofern Sie den Zugriff unterbinden, kann es hierdurch zu Funktionseinschränkungen auf der Website kommen.\nSSL-Verschlüsselung\nUm die Sicherheit Ihrer Daten bei der Übertragung zu schützen, verwenden wir dem aktuellen Stand der Technik entsprechende Verschlüsselungsverfahren (z. B. SSL) über HTTPS.\nÄnderung unserer Datenschutzbestimmungen\nWir behalten uns vor, diese Datenschutzerklärung anzupassen, damit sie stets den aktuellen rechtlichen Anforderungen entspricht oder um Änderungen unserer Leistungen in der Datenschutzerklärung umzusetzen, z.B. bei der Einführung neuer Services. Für Ihren erneuten Besuch gilt dann die neue Datenschutzerklärung.\nFragen an den Datenschutzbeauftragten\nWenn Sie Fragen zum Datenschutz haben, schreiben Sie uns bitte eine E-Mail oder wenden Sie sich direkt an die für den Datenschutz verantwortliche Person in unserer Organisation:\nDie Datenschutzerklärung wurde mithilfe der activeMind AG erstellt, den Experten für externe Datenschutzbeauftragte (Version 2019-04-10)."},"leon/How-to-overcomplicate-a-website-or-how-I-set-this-blog-up":{"title":"How to overcomplicate a website or how I set this blog up","links":[],"tags":["Webdev"],"content":"How does this work?\nThis website is powered by Obsidian and Quartz. I can highly recommend checking these tools out.\nObsidian is a note taking app, that I use for my life in general. Quartz basically enables my notes to go online and gives me the possibility to customize everything. Nowadays there are Notion, Roam and many more. I stick to Obsidian as it feels very open and community driven. If the service ends, I’ll still have my .md files which I can use just fine. I’m no fan of proprietary file formats.\nIf you want to get startet with Quartz, you can also check out their Discord Community!"}}